import { Hymn, ChoirMember } from './types';

export const HYMNS: Hymn[] = [
  {
    id: 1,
    title: "نفسي اعيش مبسوط",
    lyrics: `قرار: نفسى أعيش مبسوط وياك يا بابا يسوع
نفسى ما تسمع صوت غير صوت قلبى المسموع

1- وأغمض عينى وأصلى وأحكى لك كل متاعبى
وأنت وياى ياربى بإيديك الحلوة حاضني

2- لحظات حلوة فى حياتى 
وأنا واقف أقرأ مزمور
وما فيش فى الأوضة وياى غيرك وماليها نور

3- يا سلام يا يسوع لحظات
وبسرعة مرت بى
وأقف وبأقول صلوات
وملايكة رايحة وجاية`
  },
  {
    id: 2,
    title: "افراح السما ما اعظمها",
    lyrics: `أفراح السما ما أعظمها... بالخاطي لما يتوب
وطريقه خطوات مرسومه...و شرحها لينا يعقوب
وطوباهم اللي يقروها ويعملوا بالكتوب
*اعترفوا بالزلات اول طريق الغفران
لو قلت انا غلطان تبقي خزيت الشيطان
*صلى في المشقات اطلب م الرب تتوب
هو غافر الزلات والغالب في الحروب
*ادعو قسوس الكنيسه حاملي أسرار الله
مِسحه مرضى وتناول للروح والجسد حياه
*رد الخاطي عن طريقه الخدمه تصون طرفين
تخلص نفس من الموت وتستر خطايا الاتنين
*مسرور صلى ورتل ما أجمل التسبيح
يسعد قلبك ديما يحفظ فكرك في المسيح`
  },
  {
    id: 3,
    title: "الله الذي لنا",
    lyrics: `(1) اللهُ الذي لَنا
لا يترُكَنا أبدًا
بل يُهدينا ويَحمينا
عينه علينا


(ق) رُّبنا لا ينسانا
وهو دائمًا معنا
في طريقِ ذي الحياةِ
يَتَقَدمنا


(3) معنا وسطَ رحبِنا
يُبهجُ قلُوبَنا
وفي ضِيقِنا يَسُدُّ
كلَّ عَوزِنا


(4) نَرفَعُ رُؤوسَنا
أمامَ عدُوِّنا
لا نهابُ الخَصمَ كلاَّ
فَمن عَلينا


(5) ولتشدُ قُلُوبُنا
بابتهاجٍ في هَنا
لا نخافُ ظلَّ الموتِ
فاللهُ معنا`
  },
  {
    id: 4,
    title: "عندي حكايا هقولها",
    lyrics: `1- عندي حكاية هاقولها للأولاد أولاد أصحابي ومن كل البلاد
حكاية عني وعن يسوع حبيبي ونصرتنا الأكيدة على مكر الشيطان
 *فتحوا ودانكم وانتبهوا لي كويس علشان تنتصروا دايماً وتبقوا في أمان* 2

2- في الضلمة ماشي في مرة من المرات جالي يتسحب كأمكر الحيات
حاول يقول لي دا إنت ماشي لوحدك وفي الظلمة إنت ماشي قوام هات إيدك هات
 *قلت له امشي لأني مش لوحدي يسوع ماسك في إيدي ده هو عشاني مات* 2

3- وفي مرة بالعب مع ابن الجيران جه قاللي اكذب عشان تبقى الكسبان
قلت لأه يسوع راح يزعل مني و قلبي مش هايفرح مادام هو زعلان
 *قام فر مني وجه جنبي يسوعي في لحظة لقيته جنبي وحسيت بالأمان* 2

 **4- خدها نصيحة على مدي الأيام إبليس لو جالك ماتسمعلوش كلام* 
 *قول له يا شاطر ماتتشطرش * عليا علشان أنا مش قدك مالكش معايا كلام* 
 *إن كنت شاطر تروح تتحدى ربي وهو هايوري لك ويغلبك* تمام* 
*علي علشان أنا مش قدك مالكش معايا كلام** 
 *إنت كنت شاطر تروح تتحدى ربي وهو هايوري لك ويغلبك تمام*`
  },
  {
    id: 5,
    title: "أية",
    lyrics: `٤الْمَحَبَّةُ تَتَأَنَّى وَتَرْفُقُ. الْمَحَبَّةُ لاَ تَحْسِدُ. الْمَحَبَّةُ لاَ تَتَفَاخَرُ، وَلاَ تَنْتَفِخُ، ٥وَلاَ تُقَبِّحُ، وَلاَ تَطْلُبُ مَا لِنَفْسِهَا، وَلاَ تَحْتَدُّ، وَلاَ تَظُنُّ السُّؤَ، ٦وَلاَ تَفْرَحُ بِالإِثْمِ بَلْ تَفْرَحُ بِالْحَقِّ، ٧وَتَحْتَمِلُ كُلَّ شَيْءٍ، وَتُصَدِّقُ كُلَّ شَيْءٍ، وَتَرْجُو كُلَّ شَيْءٍ، وَتَصْبِرُ عَلَى كُلِّ شَيْءٍ. ٨اَلْمَحَبَّةُ لاَ تَسْقُطُ أَبَدًا.`
  },
  {
    id: 6,
    title: "للأمام سر",
    lyrics: `**للأمام سر ده شعارنا مافيش محلك سر اتبع قائدنا
للأمام سر اتبع فادي الورى مافيش للخلف در ولا رجوع ورا

1- إحنا جنود الرب في الميدان شايلين سلاحنا وترسنا الإيمان
ورا قائدنا حاسين بالأمان دايماً شعارنا للأمام سر

** للأمام سر ده شعارنا مافيش محلك سر اتبع قائدنا
للأمام سر اتبع فادي الورى مافيش للخلف در ولا رجوع ورا
         (موسيقي) 
2- رايحين نهاجم خصمنا الشيطان اللي يحاربنا في كل مكان
صليب قائدنا غلبه من زمان نرفع رايتنا للأمام سر
         
** للأمام سر ده شعارنا مافيش محلك سر اتبع قائدنا
للأمام سر اتبع فادي الورى مافيش للخلف در ولا رجوع ورا
           (موسيقى) 
3- لا يهمنا جبال ولا هضاب ولا توقفنا أبداً صعاب
يمين قائدنا تفتح الأبواب دايماً هتافنا للأمام سر

** للأمام سر ده شعارنا مافيش محلك سر اتبع قائدنا
للأمام سر اتبع فادي الورى مافيش للخلف در ولا رجوع ورا`
  },
  {
    id: 7,
    title: "مراحمك يا الاهي",
    lyrics: `​مراحمك يا إلهي غير محصاة وكثيرة جداً هي رأفاتك.
​قطرات المطر: محصاة عندك جميعها: ورمل البحر: كائن أمام عينيك
​فكم بالحري خطايا نفسي: هذه الظاهرة: أمامك يا ربي.
​الخطايا التي صنعتها يا ربي لا تذكرها: ولا تحسب: آثامي
​فإن العشار اخترته: والزانية خلصتها: واللص اليمين: يا سيدي ذكرته.
​وأنا أيضاً الخاطئ: يا سيدي علمني: أن أصنع توبة.
​لأنك لا تشأ: موت الخاطئ مثل أن يرجع: وتحيا نفسه.
​ردنا يا الله إلي خلاصك: وعاملنا كصلاحك.
​لأنك أنت صالح ورحوم فلتدركنا رأفاتك سريعا
​ترائف علينا كلنا أيها الرب الإله: مخلصنا وإرحمنا كعظيم رحمتك.
​هؤلاء اذكرهم: يا سيدنا المسيح: كن في وسطنا: صارخاً قائلاً
​سلامي أنا: أعطيكم: سلام أبي: أتركه معكم.
​يا ملك السلام: أعطنا سلامك: قرر لنا سلامك: وأغفر لنا خطايانا.
​فرق أعداء الكنيسة: وحصنها: فلا تتزعزع: إلي الأبد.
​عمانوئيل إلهنا في وسطنا الآن: بمجد أبيه والروح القدس
​ليباركنا كلنا: ويُطهر قلوبنا: أمراض نفوسنا وأجسادنا.
​نسجد لك ايها المسيح: مع أبيك الصالح: والروح القدس: لأنك أتيت وخلصتنا`
  }
];

export const CHOIR_MEMBERS: ChoirMember[] = [
  { id: 1, name: "مينا مجدي", role: "قائد الكورال" },
  { id: 2, name: "كيرلس سامي", role: "عازف بيانو" },
  { id: 3, name: "بيتر نبيل", role: "عازف جيتار" },
  { id: 4, name: "مارينا عادل", role: "سوبرانو" },
  { id: 5, name: "جوجو", role: "ألتو" },
  { id: 6, name: "ديفيد", role: "تينور" },
  { id: 7, name: "مايكل", role: "باص" },
  { id: 8, name: "ساندرا", role: "مرنمة" },
  { id: 9, name: "توماس", role: "مرنم" },
  { id: 10, name: "جولي", role: "مرنمة" },
  { id: 11, name: "فادي", role: "إيقاع" },
  { id: 12, name: "مارك", role: "هندسة صوتية" }
];