import { Hymn, ChoirMember, ChoirVideo } from './types';

/**
 * MANUAL COLOR TAGS GUIDE:
 * Add these codes at the start of any line in 'lyrics' to force specific colors/styles.
 * 
 * [R] : Red    -> Used for Chorus Titles (e.g. "القرار")
 * [Y] : Yellow -> Used for Chorus Lyrics
 * [B] : Blue   -> Used for Verses
 * [E] : English -> Left-to-Right direction, English font, Lighter Color
 * [P] : Paragraph Spacer -> Creates a larger vertical gap (empty line)
 * 
 * Example:
 * [R]القرار
 * [Y]للأمام سر ده شعارنا
 * [P]
 * [B]1- إحنا جنود الرب
 */

export const HYMNS: Hymn[] = [
  {
    id: 1,
    title: "للامام سر",
    lyrics: `
[Y] للأمام سر ده شعارنا 
[Y] مافيش محلك سر اتبع قائدنا
[Y] للأمام سر اتبع فادي الورى
[Y] مافيش للخلف در ولا رجوع ورا

[R]  (موسيقي) 

إحنا جنود الرب في الميدان 
شايلين سلاحنا وترسنا الإيمان
ورا قائدنا حاسين بالأمان 
دايماً شعارنا للأمام سر

[Y] للأمام سر ده شعارنا 
[Y] مافيش محلك سر اتبع قائدنا
[Y] للأمام سر اتبع فادي الورى
[Y] مافيش للخلف در ولا رجوع ورا

[R]  (موسيقي)  

رايحين نهاجم خصمنا الشيطان 
اللي يحاربنا في كل مكان
صليب قائدنا غلبه من زمان 
نرفع رايتنا للأمام سر
         
[Y] للأمام سر ده شعارنا 
[Y] مافيش محلك سر اتبع قائدنا
[Y] للأمام سر اتبع فادي الورى
[Y] مافيش للخلف در ولا رجوع ورا

[R]  (موسيقي)  

لا يهمنا جبال ولا هضاب 
ولا توقفنا أبداً صعاب
يمين قائدنا تفتح الأبواب 
دايماً هتافنا للأمام سر

[Y] للأمام سر ده شعارنا 
[Y] مافيش محلك سر اتبع قائدنا
[Y] للأمام سر اتبع فادي الورى
[Y] مافيش للخلف در ولا رجوع ورا


`
  },
  {
    id: 2,
    title: "ستة ايام",
    lyrics: `
[Y] شوف اول اصحاح
[Y] من سفر التكوين
[Y] كل مسا و صباح
[Y] ربي يقول سامعين ؟  

هاحكي لموسي كلام 
كون مخلوق بسلام  
بس ف ست ايام
[B] سامعين ليك يا معين

	بارك اول يوم 
  شال النور م الضلمه  
	قال الليل للنوم
  و املي نهارك همّه  
	

	تاني يوم خليت 
  فوقنا سمانا العاليه  
	ل الطير هي البيت 
  نسرح فيها شويه



[B]	بارك اول يوم 
  شال النور م الضلمه  
[B]	قال الليل للنوم
  و املي نهارك همّه 

[B] تاني يوم خليت 
[B] فوقنا سمانا العاليه  
	 ل الطير هي البيت 
  نسرح فيها شويه
	
[Y] شوف اول اصحاح
[Y] من سفر التكوين
[Y] كل مسا و صباح
[Y] ربي يقول سامعين ؟  

هاحكي لموسي كلام 
كون مخلوق بسلام  
بس ف ست ايام
[B] سامعين ليك يا معين



تالت يوم تنظيم 
 من بين ارض و ميّا  
و نبات خيره عظيم 
 زيّن بيه الدنيا  


رابع يوم بنور 
 قرص الشمس مدوّر  
و اما الأرض تدور 
 نلقي قمر بينوّر





[B] تالت يوم تنظيم 
من بين ارض و ميّا  
[B] و نبات خيره عظيم 
 زيّن بيه الدنيا  


[B]رابع يوم بنور 
[B] قرص الشمس مدوّر  
و اما الأرض تدور 
 نلقي قمر بينوّر

[Y] شوف اول اصحاح
[Y] من سفر التكوين
[Y] كل مسا و صباح
[Y] ربي يقول سامعين ؟  

هاحكي لموسي كلام 
كون مخلوق بسلام  
بس ف ست ايام
[B] سامعين ليك يا معين




خامس يوم يا طيور
 هاتعيشوا بكل امان  
تنيّن مع عصفور 
 و تلاعبو السمكه كمان  

و فرح سادس يوم 
 أنهي خلق الحيوان  
سمّاه اجمل يوم 
 و خلق فيه الإنسان



[B] خامس يوم يا طيور
 هاتعيشوا بكل امان  
[B] تنيّن مع عصفور 
 و تلاعبو السمكه كمان  


[B] و فرح سادس يوم 
[B] أنهي خلق الحيوان  
سمّاه اجمل يوم 
 و خلق فيه الإنسان

[Y] شوف اول اصحاح
[Y] من سفر التكوين
[Y] كل مسا و صباح
[Y] ربي يقول سامعين ؟  

هاحكي لموسي كلام 
كون مخلوق بسلام  
بس ف ست ايام
[B] سامعين ليك يا معين

`
  },
  {
    id: 3,
    title: "زى ما موسى",
    lyrics: `
    
[Y] زي ما موسى في البريه 
[Y] رفع الحيه النحاسيه
[Y] مات يسوع على الصليب
[Y] وحمل عنا الخطيه

لما لقنا كلنا أشرار 
وان مصرنا هلاك في النار
رفع يسوع على الصليب 
وحمل عنا الخطيه

[Y] زي ما موسى في البريه 
[Y] رفع الحيه النحاسيه
[Y] مات يسوع على الصليب
[Y] وحمل عنا الخطيه


اللي يصدق بالإيمان
لو كان في ايدين الشيطان
يسوع في لحظه يخلصه
ويعطيه الحياه الابديه

[Y] زي ما موسى في البريه 
[Y] رفع الحيه النحاسيه
[Y] مات يسوع على الصليب
[Y] وحمل عنا الخطيه


`
  },
  {
    id: 10,
    title: "لم ترى عين",
    lyrics: `
 
 لَمْ تَرَ عَيْنٌ
 إِلهًا غَيْرَكَ
 يَفْتَحُ السِّجْنَ
 وَيَنْزِعُ الْقُيُودْ

وَيَشُقُّ الْغَمْرَ
فَإِذَا طَرِيقْ
لا تَعُوقُهُ
جِبَالٌ أَوْ سُدُودْ

[Y] لَمْ تَرَ عَيْنٌ
[Y] إِلهًا غَيْرَكَ

مَنْ سِوَاكَ
يَتَرَاءَى فِي الأتُونْ
أَوْ يُنَجِّي النَّفْسَ
مِنْ جُبِّ الأسُودْ

مَنْ يُنِيرُ الْقَفْرَ
إِنْ حَلَّ الظَّلامْ
بِلَهِيبِ حُبٍّ
فِي صُورَةْ عَمُودْ

[Y] لَمْ تَرَ عَيْنٌ
[Y] إِلهًا غَيْرَكَ



كَمْ تَأَلَّمْتَ
عَلَى عُودِ الصَّلِيبْ
كَيْ تُعِدَّ لِي
مَكَانًا فِي الْخُلُودْ

وَوَعَدْتَنِي سَتَأْتِي
عَنْ قَرِيبْ
وَتَهَبْنِي ثِقْلَ
مَجْدٍ بِالصُّعُودْ

[Y] لَمْ تَرَ عَيْنٌ
[Y] إِلهًا غَيْرَكَ


`



  },
  {
    id: 4,
    title: "مراحمك يا الهى",
    lyrics: `
    
    
    
مراحمك يا إلهي غير محصاة 
وكثيرة جداً هي رأفاتك.

[B] قطرات المطر: محصاة عندك جميعها: 
[B] ورمل البحر: كائن أمام عينيك


فكم بالحري خطايا نفسي: 
هذه الظاهرة: أمامك يا ربي.

[B] الخطايا التي صنعتها يا ربي لا تذكرها: 
[B] ولا تحسب: آثامي


فإن العشار اخترته: والزانية خلصتها: 
 واللص اليمين: يا سيدي ذكرته.
[B] وأنا أيضاً الخاطئ: يا سيدي 
[B] علمني: أن أصنع توبة.


لأنك لا تشأ: موت الخاطئ 
مثل أن يرجع: وتحيا نفسه.

[B] ردنا يا الله إلي خلاصك: 
[B] وعاملنا كصلاحك.


لأنك أنت صالح ورحوم 
فلتدركنا رأفاتك سريعا


[B] ترائف علينا كلنا أيها الرب الإله: 
[B] مخلصنا وإرحمنا كعظيم رحمتك.

هؤلاء اذكرهم: يا سيدنا المسيح:
كن في وسطنا: صارخاً قائلاً

[B] سلامي أنا: أعطيكم: 
[B] سلام أبي: أتركه معكم.


 يا ملك السلام: أعطنا سلامك: 
 قرر لنا سلامك: وأغفر لنا خطايانا.

 
[B] فرق أعداء الكنيسة: وحصنها: 
[B] فلا تتزعزع: إلي الأبد.


عمانوئيل إلهنا في وسطنا الآن: 
بمجد أبيه والروح القدس


[B] ليباركنا كلنا: ويُطهر قلوبنا: 
[B] أمراض نفوسنا وأجسادنا.

نسجد لك ايها المسيح: مع أبيك الصالح: 
والروح القدس: لأنك أتيت وخلصتنا`
  },
  {
    id: 5,
    title: "الله الذى لنا",
    lyrics: `
اللهُ الذي لَنا
لا يترُكَنا أبدًا
بل يُهدينا ويَحمينا
عينه علينا

[Y] رُّبنا لا ينسانا
[Y] وهو دائمًا معنا
[Y] في طريقِ ذي الحياةِ
[Y] يَتَقَدمنا

معنا وسطَ رحبِنا
يُبهجُ قلُوبَنا
وفي ضِيقِنا يَسُدُّ
كلَّ عَوزِنا

[Y] رُّبنا لا ينسانا
[Y] وهو دائمًا معنا
[Y] في طريقِ ذي الحياةِ
[Y] يَتَقَدمنا


نَرفَعُ رُؤوسَنا
أمامَ عدُوِّنا
لا نهابُ الخَصمَ كلاَّ
فَمن عَلينا

[Y] رُّبنا لا ينسانا
[Y] وهو دائمًا معنا
[Y] في طريقِ ذي الحياةِ
[Y] يَتَقَدمنا

ولتشدُ قُلُوبُنا
بابتهاجٍ في هَنا
لا نخافُ ظلَّ الموتِ
فاللهُ معنا

[Y] رُّبنا لا ينسانا
[Y] وهو دائمًا معنا
[Y] في طريقِ ذي الحياةِ
[Y] يَتَقَدمنا

`
  },
  {
    id: 6,
    title: "مين اصحابك",
    lyrics: `
    
[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  
[Y] و أنت بتختار مين أصحابك  

[Y] لازم يبقي 
[R] مناسب 

[Y] مناسب جداً   
[Y] أصله هايبقي من أحبابك

[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  


يوناثان حب داود ف إداله  
سيفه و قوسه و حتي حزامه  
[B] سيفه و قوسه و حتي حزامه

عهد الحب ما بينا 
يا صاحبي  
كل الدنيا تهون قدامه
[B] كل الدنيا تهون قدامه

عهد الحب ما بينا 
يا صاحبي  
كل الدنيا تهون قدامه

[B] بُص يا صاحبي 
[R] و ركز 

[B] و ركز جداً  


[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  
[Y] و أنت بتختار مين أصحابك  

[Y] لازم يبقي 
[R] مناسب 

[Y] مناسب جداً   
[Y] أصله هايبقي من أحبابك

[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  

[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  


سيلا و بولس رغم آلامهم  
جوه السجن نلاقي إيمانهم  
[B] جوه السجن نلاقي إيمانهم  


اصحاب بصلاتهم تتزلزل  
ارض السجن بأمر خلاصهم
[B] ارض السجن بأمر خلاصهم

اصحاب بصلاتهم تتزلزل  
ارض السجن بأمر خلاصهم

[B] بُص يا صاحبي 
[R] و ركز 

[B] و ركز جداً  



[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  
[Y] و أنت بتختار مين أصحابك  

[Y] لازم يبقي 
[R] مناسب 

[Y] مناسب جداً   
[Y] أصله هايبقي من أحبابك

[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  

[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  

أصل الصاحب فيك بيأثر  
لو كان فاسد بيه تتأثر 
[B] لو كان فاسد بيه تتأثر 

و إن كان صاحب فعلا شاطر  
و ياه إنت كمان تتشطر 
[B] و ياه إنت كمان تتشطر 

و إن كان صاحب فعلا شاطر  
و ياه إنت كمان تتشطر 

[B] بُص يا صاحبي 
[R] و ركز 

[B] و ركز جداً  


[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  
[Y] و أنت بتختار مين أصحابك  

[Y] لازم يبقي 
[R] مناسب 

[Y] مناسب جداً   
[Y] أصله هايبقي من أحبابك

[Y] بُص يا صاحبي 
[R] و ركز 

[Y] و ركز جداً  





`
  },
  {
    id: 7,
    title: "الشفاعة",
    lyrics: `
[Y] في الشفاعه قال إلهنا
[Y] الشفاعه حُب غالي  

[Y] قال ولاده بمجد زادنا 
[Y] اصله أب في مجد عالي  

[Y] قال صلاتكم دي قابلها 
[Y] اطلبو لبعض ف صلاتكم  

[Y] وعد مني هاكون سامعها 
[Y] و أدي خير يملي حياتكم

ل,في أمتحاني كنت شاطر
أصل ربي كان معايا  

شاف أمانتي عشان مذاكر 
و ف صلاتي شفيع معايا  

كل ماده و ليها صاحب 
من السما يطلب عشاني  

قديسين شهداء و حبايب 
كُلهم صلوا عشاني

[Y] في الشفاعه قال إلهنا
[Y] الشفاعه حُب غالي  

[Y] قال ولاده بمجد زادنا 
[Y] اصله أب في مجد عالي  

[Y] قال صلاتكم دي قابلها 
[Y] اطلبو لبعض ف صلاتكم  

[Y] وعد مني هاكون سامعها 
[Y] و أدي خير يملي حياتكم


,صاحبي لو تعبان أصلي 
ربنا يقبل صلاتي  

ربنا يفرح تملّي 
طول ما سامع صوت صلاتي 

و اما اشوفه خف افرح 
 و أجري أشكر تاني ربي  

السما بيّا بتفرح.
شايفه فعلا صدق حبي

[Y] في الشفاعه قال إلهنا
[Y] الشفاعه حُب غالي  

[Y] قال ولاده بمجد زادنا 
[Y] اصله أب في مجد عالي  

[Y] قال صلاتكم دي قابلها 
[Y] اطلبو لبعض ف صلاتكم  

[Y] وعد مني هاكون سامعها 
[Y] و أدي خير يملي حياتكم


المسيح حط الشفاعه 
درس واضح و ف إيمانا 

جه فدانا و ب شجاعه 
 قام و فرحنا ب خلاصنا  

ربي نفسه نعيش حياتنا 
 كُلنا بروح المحبه  

يبقي شاف صورته ف جمالنا 
أصله هو الله محبه

[Y] في الشفاعه قال إلهنا
[Y] الشفاعه حُب غالي  

[Y] قال ولاده بمجد زادنا 
[Y] اصله أب في مجد عالي  

[Y] قال صلاتكم دي قابلها 
[Y] اطلبو لبعض ف صلاتكم  

[Y] وعد مني هاكون سامعها 
[Y] و أدي خير يملي حياتكم

`
  },
  {
    id: 8,
    title: "افراح السما ما اعظمها",
    lyrics: `
[Y] أفراح السما ما أعظمها
[Y] بالخاطي لما يتوب

[Y] وطريقه خطوات مرسومه
[Y] و شرحها لينا يعقوب

[Y] وطوباهم اللي يقروها
[Y] ويعملوا بالمكتوب

اعترفوا بالزلات 
اول طريق الغفران

لو قلت انا غلطان 
تبقي خزيت الشيطان

[Y] أفراح السما ما أعظمها
[Y] بالخاطي لما يتوب

[Y] وطريقه خطوات مرسومه
[Y] و شرحها لينا يعقوب

[Y] وطوباهم اللي يقروها
[Y] ويعملوا بالمكتوب

صلى في المشقات 
اطلب م الرب تتوب

هو غافر الزلات 
والغالب في الحروب

[Y] أفراح السما ما أعظمها
[Y] بالخاطي لما يتوب

[Y] وطريقه خطوات مرسومه
[Y] و شرحها لينا يعقوب

[Y] وطوباهم اللي يقروها
[Y] ويعملوا بالمكتوب

ادعو قسوس الكنيسه 
حاملي أسرار الله

مِسحه مرضى وتناول 
للروح والجسد حياه

[Y] أفراح السما ما أعظمها
[Y] بالخاطي لما يتوب

[Y] وطريقه خطوات مرسومه
[Y] و شرحها لينا يعقوب

[Y] وطوباهم اللي يقروها
[Y] ويعملوا بالمكتوب

رد الخاطي عن طريقه 
الخدمه تصون طرفين

تخلص نفس من الموت 
وتستر خطايا الاتنين

[Y] أفراح السما ما أعظمها
[Y] بالخاطي لما يتوب

[Y] وطريقه خطوات مرسومه
[Y] و شرحها لينا يعقوب

[Y] وطوباهم اللي يقروها
[Y] ويعملوا بالمكتوب

مسرور صلى ورتل 
ما أجمل التسبيح

يسعد قلبك ديما 
يحفظ فكرك في المسيح

[Y] أفراح السما ما أعظمها
[Y] بالخاطي لما يتوب

[Y] وطريقه خطوات مرسومه
[Y] و شرحها لينا يعقوب

[Y] وطوباهم اللي يقروها
[Y] ويعملوا بالمكتوب



`
  },
  {
    id: 9,
    title: "لحن فاى ايطاف",
    lyrics: `
    
    
فاي ايطاف انف اي ابشوي : ان أووثيسيا اسشيب : هيجين بي استافروس خا اب أووجاي امبين جينوس

[B] آفشوليم ايروف : انجي بيف يوت ان أغاثوس : ام افناف انتي هان آروهي : هيجين تي غولغوثا


تين أوؤشت إمموك أوبي إخرستوس 
نيم بيك يوت إن أغاثوس نيم بي إبنيفما إثؤواف
جي آف آشك أكسوتي إممون
`
  },
 
  {
    id: 11,
    title: "انشودة المحبة",
    lyrics: `
    
   الْمَحَبَّةُ تَتَأَنَّى وَتَرْفُقُ. 

   الْمَحَبَّةُ لاَ تَحْسِدُ .. ولاَ تَتَفَاخَرُ 

[B] الْمَحَبَّةُ تَتَأَنَّى وَتَرْفُقُ. 

[B] الْمَحَبَّةُ لاَ تَحْسِدُ .. ولاَ تَتَفَاخَرُ 



   وَلاَ لاَ تَنْتَفِخُ
   وَلاَ لاَ تُقَبِّحُ 


[B] وَلاَ لاَ تَنْتَفِخُ
[B]  وَلاَ لاَ تُقَبِّحُ 


   وَلاَ تَطْلُبُ مَا لِنَفْسِهَا 
   وَلاَ تَحْتَدُّ وَلاَ تَظُنُّ السُّؤَ 


 [B]  وَلاَ تَطْلُبُ مَا لِنَفْسِهَا 
 [B]  وَلاَ تَحْتَدُّ وَلاَ تَظُنُّ السُّؤَ 


   وَلاَ تَفْرَحُ بِالإِثْمِ 
   بَلْ تَفْرَحُ بِالْحَقِّ 

[B] وَلاَ تَفْرَحُ بِالإِثْمِ 
[B]  بَلْ تَفْرَحُ بِالْحَقِّ 



   وَتَحْتَمِلُ كُلَّ شَيْءٍ  
   وَتُصَدِّقُ كُلَّ شَيْءٍ، 
   وَتَرْجُو كُلَّ شَيْءٍ 
   وَتَصْبِرُ عَلَى كُلِّ شَيْءٍ. 


   اَلْمَحَبَّةُ لاَ تَسْقُطُ أَبَدًا
   
   اَلْمَحَبَّةُ لاَ تَسْقُطُ أَبَدًا
   

[B] الْمَحَبَّةُ تَتَأَنَّى وَتَرْفُقُ. 
[B] الْمَحَبَّةُ لاَ تَحْسِدُ .. ولاَ تَتَفَاخَرُ 

[B] وَلاَ لاَ تَنْتَفِخُ
[B]  وَلاَ لاَ تُقَبِّحُ 

 [B]  وَلاَ تَطْلُبُ مَا لِنَفْسِهَا 
 [B]  وَلاَ تَحْتَدُّ وَلاَ تَظُنُّ السُّؤَ 

 [B]  وَلاَ تَطْلُبُ مَا لِنَفْسِهَا 
 [B]  وَلاَ تَحْتَدُّ وَلاَ تَظُنُّ السُّؤَ 

  [B] وَتَحْتَمِلُ كُلَّ شَيْءٍ  
  [B]  وَتُصَدِّقُ كُلَّ شَيْءٍ، 
  [B]  وَتَرْجُو كُلَّ شَيْءٍ 
  [B] وَتَصْبِرُ عَلَى كُلِّ شَيْءٍ. 


  [Y]  اَلْمَحَبَّةُ لاَ تَسْقُطُ أَبَدًا
   
  [Y] اَلْمَحَبَّةُ لاَ تَسْقُطُ أَبَدًا

كورنثوس الاولى 13 : 4
   
   `
  },
  {
    id: 12,
    title: "عندي حكاية",
    lyrics: `

عندي حكاية هاقولها للأولاد 
أولاد أصحابي ومن كل البلاد

حكاية عني وعن يسوع حبيبي 
ونصرتنا الأكيدة على مكر الشيطان

[B] فتحوا ودانكم وانتبهوا لي كويس 
[B] علشان تنتصروا دايماً وتبقوا في أمان

[Y]  فتحوا ودانكم وانتبهوا لي كويس 
[Y] علشان تنتصروا دايماً وتبقوا في أمان


في الضلمة ماشي في مرة من المرات 
جالي يتسحب كأمكر الحيات

حاول يقول لي دا إنت ماشي لوحدك 
وفي الظلمة إنت ماشي قوام هات إيدك هات

[B] قلت له امشي لأني مش لوحدي 
[B] يسوع ماسك في إيدي ده هو عشاني مات

[Y] قلت له امشي لأني مش لوحدي 
[Y] يسوع ماسك في إيدي ده هو عشاني مات

وفي مرة بالعب مع ابن الجيران 
جه قاللي اكذب عشان تبقى الكسبان


قلت لأه يسوع راح يزعل مني 
و قلبي مش هايفرح مادام هو زعلان


[B] قام فر مني وجه جنبي يسوعي 
[B] في لحظة لقيته جنبي وحسيت بالأمان


[Y] قام فر مني وجه جنبي يسوعي 
[Y] في لحظة لقيته جنبي وحسيت بالأمان


[B] خدها نصيحة على مدي الأيام 
[B] إبليس لو جالك ماتسمعلوش كلام 


[Y] قول له يا شاطر ماتتشطرش  عليا 
[Y] علشان أنا مش قدك مالكش معايا كلام 


[B] إن كنت شاطر تروح تتحدى ربي 
[B] وهو هايوري لك ويغلبك كمان 


[Y] علي علشان أنا مش قدك 
[Y] مالكش معايا كلام 


[B] إن كنت شاطر تروح تتحدى ربي 
[B] وهو هايوري لك ويغلبك كمان 
 
 
 `
  },
  {
    id: 13,
    title: "نفسى اعيش مبسوط",
    lyrics: `
    
[Y] نفسى أعيش مبسوط 
[Y] وياك يا بابا يسوع

[Y] نفسى ما تسمع صوت 
[Y] غير صوت قلبى المسموع

وأغمض عينى وأصلى 
وأحكى لك كل متاعبى

وأنت وياى ياربى 
بإيديك الحلوة حاضني

[Y] نفسى أعيش مبسوط 
[Y] وياك يا بابا يسوع

[Y] نفسى ما تسمع صوت 
[Y] غير صوت قلبى المسموع

لحظات حلوة فى حياتى 
وأنا واقف أقرأ مزمور

وما فيش فى الأوضة 
وياى غيرك وماليها نور



[Y] نفسى أعيش مبسوط 
[Y] وياك يا بابا يسوع

[Y] نفسى ما تسمع صوت 
[Y] غير صوت قلبى المسموع

يا سلام يا يسوع لحظات
وبسرعة مرت بى

وأقف وبأقول صلوات
وملايكة رايحة وجاية


[Y] نفسى أعيش مبسوط 
[Y] وياك يا بابا يسوع

[Y] نفسى ما تسمع صوت 
[Y] غير صوت قلبى المسموع


`
  },
  {
    id: 14,
    title: "ترنيمة Joy",
    lyrics: `
    
I’ve got the joy, joy, joy, joy
down in my heart

[Y] Where?

Down in my heart!

[Y] Where?

Down in my heart!

I’ve got the joy, joy, joy, joy
down in my heart

[Y] Where? 

Down in my heart to stay


And I’m so happy, so very happy

I’ve got the love of Jesus in my heart


And I’m so happy, so very happy

I’ve got the love of Jesus in my heart



I’ve got the love of Jesus, love of Jesus
down in my heart

[Y] Where? 

Down in my heart!

[Y] Where? 

Down in my heart!

I’ve got the love of Jesus, love of Jesus
down in my heart

[Y] Where? 

Down in my heart to stay.

I've got the peace that passeth understanding,
Down in my heart,

[Y] Where? 

Down in my heart

[Y] Where? 

Down in my heart

I've got the peace that passeth understanding,
Down in my heart,

[Y] Where? 

Down in my heart to stay.

I’ve got the love of Jesus
Down in my heart,

[Y] Where? 

Down in my heart 

[Y] Where? 

Down in my heart 

I’ve got the love of Jesus,

Down in my heart 

[Y] Where? 

down in my heart to stay

 انا عندي فرح، فرح، فرح في قلبي

فين؟

فرح في قلبي

فين؟

فرح في قلبي

انا عندي فرح، فرح،فرح في قلبي

فين؟

فرح في قلبي على طول 


`
  }
];

export const CHOIR_MEMBERS: ChoirMember[] = [
  { id: 1, name: "مينا مجدي", role: "قائد الكورال" },
  { id: 2, name: "كيرلس سامي", role: "عازف بيانو" },
  { id: 3, name: "بيتر نبيل", role: "عازف جيتار" },
  { id: 4, name: "مارينا عادل", role: "سوبرانو" },
  { id: 5, name: "جوجو", role: "ألتو" },
  { id: 6, name: "ديفيد", role: "تينور" },
  { id: 7, name: "مايكل", role: "باص" },
  { id: 8, name: "ساندرا", role: "مرنمة" },
  { id: 9, name: "توماس", role: "مرنم" },
  { id: 10, name: "جولي", role: "مرنمة" },
  { id: 11, name: "فادي", role: "إيقاع" },
  { id: 12, name: "مارك", role: "هندسة صوتية" }
];

// Added new Choir Videos data
export const CHOIR_VIDEOS: ChoirVideo[] = [
  { id: 1, title: "ترنيمه لينا شفيع - كورال ليتل انجيل", link: "https://www.youtube.com/watch?v=5Z1h1KsaPQI" },
  { id: 2, title: "كورال ليتل انجيل / اسبسمس واطس لصوم الرسل", link: "https://www.youtube.com/watch?v=m3l_25cJy5w" },
  { id: 3, title: "كورال ليتل انجيل \\ ترنيمه بتحبني", link: "https://www.youtube.com/watch?v=gkHX-PuXe9Y" },
  { id: 4, title: "كورال ليتل انجيل \\ لحن نيم غار", link: "https://www.youtube.com/watch?v=wliArxYqlJw" },
  { id: 5, title: "كورال ليتل انجيل \\ ترنيمة عندي سؤال", link: "https://www.youtube.com/watch?v=VBKuUtmawkk" },
  { id: 6, title: "ترنيمة قديس صامت | كورال ليتل انجيل", link: "https://www.youtube.com/watch?v=YXa4ZDrO4gc" },
  { id: 7, title: "ترنيمة نونو صغير / كورال little angel", link: "https://www.youtube.com/watch?v=K1dSGr41idA" },
  { id: 8, title: "ترنيمة السنة ديا \\ كورال Little angel", link: "https://www.youtube.com/watch?v=SVca7DV3GYs" },
  { id: 9, title: "افرحي يا والدة الاإله كورال little angel", link: "https://www.youtube.com/watch?v=ucYUuCN-FvA" },
  { id: 10, title: "ترنيمه بنت مطيعة كورال اطفال little angel", link: "https://www.youtube.com/watch?v=QyOiI_Ze-eU" },
  { id: 11, title: "ترنيمه 70 كارز اسم الكورال: كورال أطفال little Angel", link: "https://www.youtube.com/watch?v=qBw6qYpWdf0" },
  { id: 12, title: "ترنيمه Happy birthday to jesus _كورال اطفال little angel", link: "https://www.youtube.com/watch?v=27BHaO7aLxg" },
  { id: 13, title: "ترنيمة باب المزود_لكورال اطفال LITTLE ANGEL", link: "https://www.youtube.com/watch?v=nZ-YXtb0BY8" },
  { id: 14, title: "ترنيمة لفت ساعه _كورال اطفالlittle angel", link: "https://www.youtube.com/watch?v=Hd8TqN32zsU" },
  { id: 15, title: "لحن تينين للثلاثه فتيه القديسين...كورال اطفال little angel", link: "https://www.youtube.com/watch?v=he2XQM7mJNc" },
  { id: 16, title: "ترنيمه القيامه.. اطلعي يا شمس", link: "https://www.youtube.com/watch?v=vS1Hbk0OntA" },
  { id: 17, title: "لحن أنا الصغير في إخوتي.. كورال أطفال little Angel", link: "https://www.youtube.com/watch?v=e7a3ilkjWWo" }
];
